// ПРИМЕЧАНИЕ: КОД СЛЕДУЕТ ЗАПУСКАТЬ НА САЙТЕ replit.com

#include <chrono>
#include <iostream>
#include <string>
#include <termios.h>
#include <thread>
#include <unistd.h>
#include <vector>
using namespace std;
// vector<int> ttm;
// cout << "\x1B[2J\x1B[H";

int getch() {
 struct termios oldt, newt;
 int ch;
 tcgetattr(STDIN_FILENO, &oldt);
 newt = oldt;
 newt.c_lflag &= ~(ICANON | ECHO);
 tcsetattr(STDIN_FILENO, TCSANOW, &newt);
 ch = getchar();
 tcsetattr(STDIN_FILENO, TCSANOW, &oldt);
 return ch;
}

// ⬛️
// ⬜️
// 🟥
// 🟧
// 🟨
// 🟩
// 🟦
// 🟪
// 🟫

void defWin(){
  std::chrono::milliseconds stop(200);
  cout << "\x1B[2J\x1B[H";
  string mgbWin[10][10] = {
  {"⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️"},
  {"⬜️","🟨","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","🟨","⬜️"},
  {"⬜️","🟨","🟨","⬜️","🟨","🟨","⬜️","🟨","🟨","⬜️"},
  {"⬜️","🟨","🟨","⬜️","🟨","🟨","⬜️","🟨","🟨","⬜️"},
  {"⬜️","🟨","🟨","🟨","🟨","🟨","🟨","🟨","🟨","⬜️"},
  {"⬜️","🟨","🟨","🟨","🟥","🟥","🟨","🟨","🟨","⬜️"},
  {"⬜️","🟨","🟨","🟨","🟥","🟥","🟨","🟨","🟨","⬜️"},
  {"⬜️","🟨","🟨","🟨","🟥","🟥","🟨","🟨","🟨","⬜️"},
  {"⬜️","⬜️","🟨","🟨","🟨","🟨️","🟨️","🟨","⬜️","⬜️"},
  {"⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️"},
  };
  for(int i = 0; i < 10; i++){
    for(int j = 0; j < 10; j++){
      cout<<mgbWin[i][j];
    }
    std::this_thread::sleep_for(stop);
    cout<<endl;
  }
  cout<<"You Win!"<<endl;
  exit(0);
}
void defLose(){
  std::chrono::milliseconds stop(200);
  cout << "\x1B[2J\x1B[H";
  string mgbLose[10][10] = {
  {"⬛️","⬛️","⬛️","⬛️","⬛️","⬛️","⬛️","⬛️","⬛️","⬛️"},
  {"⬛️","⬛️","⬜️","⬜️","⬜️","⬜️","⬜️","⬛️","⬛️","⬛️"},
  {"⬛️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬛️","⬛️"},
  {"⬛️","⬜️","⬛️","⬛️","⬜️","⬛️","⬛️","⬜️","⬛️","⬛️"},
  {"⬛️","⬜️","⬛️","⬛️","⬜️","⬛️","⬛️","⬜️","⬛️","⬛️"},
  {"⬛️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬛️","⬛️"},
  {"⬛️","⬛️","⬜️","⬜️","⬛️","⬜️","⬜️","⬛️","⬛️","⬛️"},
  {"⬛️","⬛️","⬛️","⬜️","⬜️","⬜️","⬛️","⬛️","⬛️","⬛️"},
  {"⬛️","⬛️","⬛️","⬜️","⬜️","⬜️","⬛️","⬛️","⬛️","⬛️"},
  {"⬛️","⬛️","⬛️","⬛️","⬛️","⬛️","⬛️","⬛️","⬛️","⬛️"},
  };
  for(int i = 0; i < 10; i++){
    for(int j = 0; j < 10; j++){
      cout<<mgbLose[i][j];
    }
    std::this_thread::sleep_for(stop);
    cout<<endl;
  }
  cout<<"You Lose!"<<endl;
  exit(0);
}

void defBetaGame(){
  cout << "\x1B[2J\x1B[H";
  string mgbLVL1[10][10]={
    {"🟥","🟥","🟥","🟥","🟥","🟥️","🟥","🟥","🟥","🟥"},
    {"🟥","⬜️","🟥","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","🟥"},
    {"🟥","⬜️","🟥","⬜️","🟥","🟥","🟥","🟥","⬜️","🟥"},
    {"🟥","⬜️","🟥","⬜️","🟥","🟫","🟫","🟥","⬜️","🟥"},
    {"🟥","⬜️","🟥","⬜️","🟥","🟫","🟫","🟥","⬜️","🟥"},
    {"🟥","⬜️","🟥","⬜️","🟥","🟥","⬜️","🟥","⬜️","🟥"},
    {"🟥","⬜️","🟥","⬜️","⬜️","⬜️","⬜️","🟥","⬜️","🟥"},
    {"🟥","⬜️","🟥","🟥","🟥","🟥","🟥️","🟥","⬜️","🟥"},
    {"🟥","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","🟥"},
    {"🟥","🟥","🟥","🟥","🟥","🟥️","🟥","🟥","🟥","🟥"},
    };

  int countBroun = 0;

  for(int i = 0; i < 10; i++){
    for(int j = 0; j < 10; j++){
      if(mgbLVL1[i][j] == "🟫"){
        countBroun++;
      }
    }
  }
  int optX = 1;
  int optY = 1;
  string mapGame[10][10];
  while (true) {
    cout<<"Для прохождения вам необходимо закрасить все коричневые квадраты"<<endl;
    cout<<"Опасайтесь красной территории"<<endl;
    cout<<"управление:"<<endl;
    cout<<"   W      закрасить:   "<<endl;
    cout<<" A S D      SPASE"<<endl;
    int countGreen = 0;
    for (int i = 0; i < 10; i++) {
      for (int j = 0; j < 10; j++) {
        mapGame[i][j] = mgbLVL1[i][j];
        if(mgbLVL1[i][j] == "🟩"){
          countGreen++;
        }
        if(mgbLVL1[optY][optX] == "🟥"){
          defLose();
        }
        if(countBroun == countGreen){
          defWin();
        }


        mapGame[optY][optX] = "⬛️";
        cout<< mapGame[i][j];
      }
      cout << endl;
    }

    int key = getch();
    switch (key){
    case 32:
      if(mgbLVL1[optY][optX] == "🟫"){
        mgbLVL1[optY][optX] = "🟩";
      }
      cout << "\x1B[2J\x1B[H";
      break;

    case 119://key w
      if (optY > 0) {
        optY--;
      }
      cout << "\x1B[2J\x1B[H";
      break;

    case 115://key s
      if (optY < 9) {
        optY++;
      }
      cout << "\x1B[2J\x1B[H";
      break;

    case 97://key a
      if (optX > 0) {
        optX--;
      }
      cout << "\x1B[2J\x1B[H";
      break;

    case 100://key d
      if (optX < 9) {
        optX++;
      }
      cout << "\x1B[2J\x1B[H";
      break;

    default:
      break;
    }
  }
}

int main() {
  cout << "\x1B[2J\x1B[H";
  string startMenu[14][21] = {
  {"⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️"},
  {"⬜️","⬛️","⬛️","⬛️","⬜️","⬛️","⬛️","⬛️","⬜️","⬛️","⬛️","⬛️","⬜️","⬛️","⬛️","⬛️","⬜️","⬛️","⬛️","⬛️","⬜️"},
  {"⬜️","⬛️","⬜️","⬜️","⬜️","⬜️","⬛️","⬜️","⬜️","⬛️","⬜️","⬛️","⬜️","⬛️","⬜️","⬛️","⬜️","⬜️","⬛️","⬜️","⬜️"},
  {"⬜️","⬛️","⬛️","⬛️","⬜️","⬜️","⬛️","⬜️","⬜️","⬛️","⬜️","⬛️","⬜️","⬛️","⬛️","⬜️","⬜️","⬜️","⬛️","⬜️","⬜️"},
  {"⬜️","⬜️","⬜️","⬛️","⬜️","⬜️","⬛️","⬜️","⬜️","⬛️","⬛️","⬛️","⬜️","⬛️","⬜️","⬛️","⬜️","⬜️","⬛️","⬜️","⬜️"},
  {"⬜️","⬛️","⬛️","⬛️","⬜️","⬜️","⬛️","⬜️","⬜️","⬛️","⬜️","⬛️","⬜️","⬛️","⬜️","⬛️","⬜️","⬜️","⬛️","⬜️","⬜️"},
  {"⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️"},
  {"⬜️","⬜️","🟩","⬜️","⬜️","🟩","⬜️","⬜️","⬜️","⬛️","⬛️","⬛️","⬜️","⬜️","⬜️","🟥","⬜️","⬜️","🟥","⬜️","⬜️"},
  {"⬜️","⬜️","🟩","⬜️","⬜️","🟩","⬜️","⬜️","⬜️","⬜️","⬜️","⬛️","⬜️","⬜️","⬜️","🟥","⬜️","⬜️","🟥","⬜️","⬜️"},
  {"⬜️","⬜️","🟩","🟩","🟩","🟩","⬜️","⬜️","⬜️","⬜️","⬜️","⬛️","⬜️","⬜️","⬜️","🟥","🟥","⬜️","🟥","⬜️","⬜️"},
  {"⬜️","⬜️","⬜️","⬜️","⬜️","🟩","⬜️","⬜️","⬜️","⬜️","⬛️","⬜️","⬜️","⬜️","⬜️","🟥","⬜️","🟥","🟥","⬜️","⬜️"},
  {"⬜️","⬜️","🟩","🟩","🟩","🟩","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","🟥","⬜️","⬜️","🟥","⬜️","⬜️"},
  {"⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬛️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️"},
  {"⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️","⬜️"}};

  int YorN = 1;
  
  int optX = 2;
  int optY = 13;
  string mapGame[14][21];
  while (true) {
    for (int i = 0; i < 14; i++) {
      for (int j = 0; j < 21; j++) {
        mapGame[i][j] = startMenu[i][j];

        mapGame[optY][optX+3] = "🟦";
        mapGame[optY][optX+2] = "🟦";
        mapGame[optY][optX+1] = "🟦";
        mapGame[optY][optX] = "🟦";

        cout<< mapGame[i][j];
      }
      cout << endl;
    }
    cout<<"            <---  A |_| D  --->"<<endl;
    int key = getch();
    switch (key){
    case 32: //spase
      if(YorN == 1){
        defBetaGame();
      }
      else{
        exit(0);
      }
      cout << "\x1B[2J\x1B[H";
      break;

    case 97: //key a
      optX = 2;
      YorN = 1;
      cout << "\x1B[2J\x1B[H";
      break;

    case 100: //key d
      optX = 15;
      YorN = 0;
      cout << "\x1B[2J\x1B[H";
      break;

    default:
      break;
    }
  }
  return 0;
}
